In [8]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

### Series

In [9]:
obj = pd.Series([4, 7, -5, 3])

In [10]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [11]:
obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [12]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
obj2 = pd.Series([4, 7, -5, 3], index = ["d", "b", "a", "c"])

In [14]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [15]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [16]:
obj2["a"]

np.int64(-5)

In [17]:
obj["d"] = 6

In [18]:
obj

0    4
1    7
2   -5
3    3
d    6
dtype: int64

In [19]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    4
dtype: int64

In [20]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [21]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [22]:
import numpy as np

In [23]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dictionary:

In [24]:
"b" in obj2

True

In [25]:
"e" in obj2

False

In [26]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [27]:
obj3 = pd.Series(sdata)

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

you can convert a series back to a dict also

In [30]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [31]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [33]:
states

['California', 'Ohio', 'Oregon', 'Texas']

In [34]:
obj4 = pd.Series(sdata, index=states)

In [35]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

he isna and notna functions in pandas should be used to detect missing data:

In [36]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods

In [38]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [39]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [40]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [41]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a name attribute, which integrates with other areas of pandas functionality:

In [42]:
obj4.name = "population"

In [43]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [44]:
obj4.index.name = "state"

In [45]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series’s index can be altered in place by assignment:

In [46]:
obj

0    4
1    7
2   -5
3    3
d    6
dtype: int64

In [47]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

ValueError: Length mismatch: Expected axis has 5 elements, new values have 4 elements

There are many ways to construct a DataFrame, though one of the most common is from a dictionary of equal-length lists or NumPy arrays:

In [48]:
data = {"state" : ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], "year": [2000, 2001, 2002, 2001, 2002, 2003], "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

The resulting DataFrame will have its index assigned automatically, as with Series, and the columns are placed according to the order of the keys in data (which depends on their insertion order in the dictionary):

In [49]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [50]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

For large DataFrames, the head method selects only the first five rows:

In [51]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

tail returns the last five rows:

In [52]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:

In [54]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dictionary, it will appear with missing values in the result:

In [55]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [56]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [57]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dictionary-like notation or by using the dot attribute notation:

In [58]:
frame["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [59]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [60]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [61]:
frame.pop

<bound method DataFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.

Rows can also be retrieved by position or name with the special iloc and loc attributes

In [62]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [63]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

Columns can be modified by assignment. For example, the empty debt column could be assigned a scalar value or an array of values

In [64]:
frame2["debt"] = 16.5

In [65]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [67]:
frame2["debt"] = np.arange(6.)

In [68]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any index values not present:

In [69]:
val = pd.Series([-1.2, -1.5, 1.7], index=[2,4,5])

In [70]:
val

2   -1.2
4   -1.5
5    1.7
dtype: float64

In [71]:
frame2["debt"] = val

In [73]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2   1.7

Assigning a column that doesn’t exist will create a new column.

The del keyword will delete columns like with a dictionary. As an example, I first add a new column of Boolean values where the state column equals "Ohio":

In [74]:
frame2["eastern"] = frame2["state"] == "Ohio"

In [75]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2   1.7    False

In [77]:
frame2.eastern

0     True
1     True
2     True
3    False
4    False
5    False
Name: eastern, dtype: bool

In [78]:
del frame2["eastern"]

In [79]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [80]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [81]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

If the nested dictionary is passed to the DataFrame, pandas will interpret the outer dictionary keys as the columns, and the inner keys as the row indices:

In [82]:
frame3 = pd.DataFrame(populations)

In [83]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:

In [84]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

The keys in the inner dictionaries are combined to form the index in the result. This isn’t true if an explicit index is specified:

In [85]:
pd.DataFrame(populations, index=[2001, 2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

Dictionaries of Series are treated in much the same way:

In [86]:
pdata = {"Ohio": frame3["Ohio"][:-1], "Nevada": frame3["Nevada"][:2]}

In [87]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [88]:
frame3.index.name = "year"

In [89]:
frame3.columns.name = "state"

In [90]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

Unlike Series, DataFrame does not have a name attribute. DataFrame's to_numpy method returns the data contained in the DataFrame as a two-dimensional ndarray:

In [91]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

If the DataFrame’s columns are different data types, the data type of the returned array will be chosen to accommodate all of the columns:

In [92]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, 1.7]], dtype=object)

pandas’s Index objects are responsible for holding the axis labels (including a DataFrame's column names) and other metadata (like the axis name or names). Any array or other sequence of labels you use when constructing a Series or DataFrame is internally converted to an Index

In [93]:
obj = pd.Series(np.arange(3), index = ["a", "b", "c"])

In [94]:
index = obj.index

In [95]:
index

Index(['a', 'b', 'c'], dtype='object')

In [99]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable and thus can’t be modified by the user:

In [100]:
index[1] = "d"

TypeError: Index does not support mutable operations

Immutability makes it safer to share Index objects among data structures:

In [101]:
labels = pd.Index(np.arange(3))

In [102]:
labels

Index([0, 1, 2], dtype='int64')

In [103]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [104]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [105]:
obj2.index is not labels

False

In [106]:
obj2.index is labels

True

In addition to being array-like, an Index also behaves like a fixed-size set:

In [107]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [108]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [109]:
"Ohio" in frame3.columns

True

In [110]:
2003 in frame3.index

False

In [115]:
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

An important method on pandas objects is reindex, which means to create a new object with the values rearranged to align with the new index. Consider an example

In [118]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d","b","a","c"])

In [119]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [120]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [121]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values

In [123]:
obj3 = pd.Series(["blue", "purple", "yellow"], index = [0,2,4])

In [124]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [127]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result:

In [128]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ["a","c","d"],columns=["Ohia","Texas","California"])

In [129]:
frame

   Ohia  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [130]:
frame2 = frame.reindex(index=["a","b","c","d"])

In [131]:
frame2

   Ohia  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindexed with the columns keyword:

In [132]:
states = ["Texas", "Utah", "California"]

In [133]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Because "Ohio" was not in states, the data for that column is dropped from the result.

Another way to reindex a particular axis is to pass the new axis labels as a positional argument and then specify the axis to reindex with the axis keyword

In [134]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

 the drop method will return a new object with the indicated value or values deleted from an axis:

In [136]:
obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])

In [137]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [138]:
new_obj = obj.drop("c")

In [139]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [140]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [141]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis. To illustrate this, we first create an example DataFrame:

In [142]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ["Ohio", "Colorado", "Utah", "New York"], columns = ["one", "two", "three", "four"])

In [143]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling drop with a sequence of labels will drop values from the row labels (axis 0):

In [144]:
data.drop(index = ["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.drop(columns = ["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

You can also drop values from the columns by passing axis=1 (which is like NumPy) or axis="columns":

In [146]:
data.drop("two", axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [147]:
data.drop(["two", "four"], axis = "columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [148]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [149]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [150]:
obj["b"]

np.float64(1.0)

In [151]:
obj[1]

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

np.float64(1.0)

In [152]:
obj.iloc[1]

np.float64(1.0)

In [154]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [155]:
obj.iloc[2:4]

c    2.0
d    3.0
dtype: float64

In [156]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [157]:
obj[[1, 3]]

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [159]:
obj.iloc[1:3]

b    1.0
c    2.0
dtype: float64

In [160]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

While you can select data by label this way, the preferred way to select index values is with the special loc operator:

In [161]:
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

The reason to prefer loc is because of the different treatment of integers when indexing with []. Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs depending on the data type of the index. For example:

In [162]:
obj1 = pd.Series([1, 2, 3], index = [2, 0, 1])

In [163]:
obj2 = pd.Series([1, 2, 3], index = ["a", "b", "c"])

In [164]:
obj1

2    1
0    2
1    3
dtype: int64

In [165]:
obj2

a    1
b    2
c    3
dtype: int64

In [166]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [167]:
obj2[[0, 1, 2]]

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

When using loc, the expression obj.loc[[0, 1, 2]] will fail when the index does not contain integers:

In [170]:
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

Since loc operator indexes exclusively with labels, there is also an iloc operator that indexes exclusively with integers to work consistently whether or not the index contains integers:

In [172]:
obj1.iloc[[0 , 1, 2]]

2    1
0    2
1    3
dtype: int64

In [173]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

You can also slice with labels, but it works differently from normal Python slicing in that the endpoint is inclusive:

In [175]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

Assigning values using these methods modifies the corresponding section of the Series:

In [176]:
obj2.loc["b":"c"] = 5

In [177]:
obj2

a    1
b    5
c    5
dtype: int64

It can be a common newbie error to try to call loc or iloc like functions rather than "indexing into" them with square brackets. The square bracket notation is used to enable slice operations and to allow for indexing on multiple axes with DataFrame objects.

Indexing into a DataFrame retrieves one or more columns either with a single value or sequence:

In [178]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index = ["Ohio", "Colorado", "Utah", "New York"], columns = ["one", "two", "three", "four"])

In [179]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [181]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. The first is slicing or selecting data with a Boolean array:

In [182]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [183]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

Another use case is indexing with a Boolean DataFrame, such as one produced by a scalar comparison. Consider a DataFrame with all Boolean values produced by comparing with a scalar value:

In [184]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

We can use this DataFrame to assign the value 0 to each location with the value True, like so:

In [185]:
 data[data < 5] = 0

In [186]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Selection on DataFrame with loc and iloc
Like Series, DataFrame has special attributes loc and iloc for label-based and integer-based indexing, respectively. Since DataFrame is two-dimensional, you can select a subset of the rows and columns with NumPy-like notation using either axis labels (loc) or integers (iloc).

As a first example, let's select a single row by label:

In [187]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [188]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

The result of selecting a single row is a Series with an index that contains the DataFrame's column labels. To select multiple roles, creating a new DataFrame, pass a sequence of labels:

In [189]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

you can combine both row and column selction in loc by seprating the selections with a comma:

In [190]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

you can do similar selections with intergers using iloc

In [191]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [192]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [193]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or lists of labels:

In [194]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

Boolean arrays can be used with loc but not iloc:

In [195]:
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

There are many ways to select and rearrange the data contained in a pandas object. For DataFrame, Table 5.4 provides a short summary of many of them. As you will see later, there are a number of additional options for working with hierarchical indexes.

Integer indexing pitfalls
Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structures like lists and tuples. For example, you might not expect the following code to generate an error:

In [196]:
ser = pd.Series(np.arange(3.))

In [197]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [198]:
ser[-1]

KeyError: -1

In [199]:
 ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [200]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

If you have an axis index containing integers, data selection will always be label oriented. As I said above, if you use loc (for labels) or iloc (for integers) you will get exactly what you want:

In [201]:
ser.iloc[-1]

np.float64(2.0)

In [202]:
ser[:2]

0    0.0
1    1.0
dtype: float64

Pitfalls with chained indexing
In the previous section we looked at how you can do flexible selections on a DataFrame using loc and iloc. These indexing attributes can also be used to modify DataFrame objects in place, but doing so requires some care.

For example, in the example DataFrame above, we can assign to a column or row by label or integer position:

In [203]:
data.loc[:, "one"] = 1

In [204]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [205]:
data.iloc[2] = 5

In [206]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [207]:
 data.loc[data["four"] > 5] = 3

In [208]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

Depending on the data contents, this may print a special SettingWithCopyWarning, which warns you that you are trying to modify a temporary value (the nonempty result of data.loc[data.three == 5]) instead of the original DataFrame data, which might be what you were intending. Here, data was unmodified:

In [209]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [210]:
data.loc[data.three == 5, "three"] = 6

In [211]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

pandas can make it much simpler to work with objects that have different indexes. For example, when you add objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs. Let’s look at an example:

In [212]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ["a", "c", "d", "e"])

In [213]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [214]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ["a", "c", "e", "f", "g"])

In [215]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

Adding these yields:

In [216]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

The internal data alignment introduces missing values in the label locations that don’t overlap. Missing values will then propagate in further arithmetic computations.

In the case of DataFrame, alignment is performed on both rows and columns:

In [217]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns = list("bcd"), index = ["Ohio", "Texas", "Colorado"])

In [218]:
df2 = pd.DataFrame(np.arange(12.).reshape ((4, 3)), columns = list ("bde"), index = ["Utah", "Ohio", "Texas", "Oregon"])

In [219]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [220]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Adding these returns a DataFrame with index and columns that are the unions of the ones in each DataFrame:

In [221]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since the "c" and "e" columns are not found in both DataFrame objects, they appear as missing in the result. The same holds for the rows with labels that are not common to both objects.

If you add DataFrame objects with no column or row labels in common, the result will contain all nulls:

In [222]:
df1 = pd.DataFrame({"A": [1, 2]})

In [223]:
df2 = pd.DataFrame({"B": [3, 4]})

In [224]:
df1

   A
0  1
1  2

In [225]:
df2

   B
0  3
1  4

In [226]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

Arithmetic methods with fill values
In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other. Here is an example where we set a particular value to NA (null) by assigning np.nan to it:

In [229]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))

In [230]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [231]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns = list("abcde"))

In [232]:
df2.loc[1, "b"] = np.nan

In [233]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [234]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [235]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1, I pass df2 and an argument to fill_value, which substitutes the passed value for any missing values in the operation:

In [236]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [237]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [239]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [240]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [241]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [242]:
arr = np.arange(12.).reshape((3, 4))

In [243]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [244]:
arr[0]

array([0., 1., 2., 3.])

In [245]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

When we subtract arr[0] from arr, the subtraction is performed once for each row. This is referred to as broadcasting and is explained in more detail as it relates to general NumPy arrays in Appendix A: Advanced NumPy. Operations between a DataFrame and a Series are similar:

In [246]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns = list ("bde"), index = ["Utah", "Ohio", "Texas", "Oregon"])

In [247]:
series = frame.iloc[0]

In [248]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [249]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between DataFrame and Series matches the index of the Series on the columns of the DataFrame, broadcasting down the rows:

In [250]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union:

In [251]:
series2 = pd.Series(np.arange(3), index = ["b", "e", "f"])

In [252]:
series2

b    0
e    1
f    2
dtype: int64

In [253]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to use one of the arithmetic methods and specify to match over the index. For example:

In [254]:
series3 = frame["d"]

In [255]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [256]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [257]:
frame.sub(series3, axis = "index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis that you pass is the axis to match on. In this case we mean to match on the DataFrame’s row index (axis="index") and broadcast across the columns.

Function Application and Mapping
NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [258]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), columns = list("bde"), index = ["Utah", "Ohio", "Texas", "Oregon"])

In [259]:
frame

               b         d         e
Utah   -1.160274 -1.001071 -0.750279
Ohio    1.145554  0.620731  0.552025
Texas  -0.561170  0.360562  2.163178
Oregon -0.517959 -0.743774  0.670927

In [260]:
np.abs(frame)

               b         d         e
Utah    1.160274  1.001071  0.750279
Ohio    1.145554  0.620731  0.552025
Texas   0.561170  0.360562  2.163178
Oregon  0.517959  0.743774  0.670927

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame’s apply method does exactly this:

In [263]:
def f1(x):
    return x.max() - x.min()

In [264]:
frame.apply(f1)

b    2.305828
d    1.621801
e    2.913458
dtype: float64

Here the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If you pass axis="columns" to apply, the function will be invoked once per row instead. A helpful way to think about this is as "apply across the columns":

In [265]:
frame.apply(f1, axis = "columns")

Utah      0.409995
Ohio      0.593529
Texas     2.724349
Oregon    1.414701
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary.

In [266]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [267]:
frame.apply(f2)

            b         d         e
min -1.160274 -1.001071 -0.750279
max  1.145554  0.620731  2.163178

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in frame. You can do this with applymap:

In [268]:
def my_format(x):
    return f"{x:.2f}"

In [269]:
frame.applymap(my_format)

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -1.16  -1.00  -0.75
Ohio     1.15   0.62   0.55
Texas   -0.56   0.36   2.16
Oregon  -0.52  -0.74   0.67

The reason for the name applymap is that Series has a map method for applying an element-wise function:

In [270]:
frame["e"].map(my_format)

Utah      -0.75
Ohio       0.55
Texas      2.16
Oregon     0.67
Name: e, dtype: object

Sorting and Ranking
Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column label, use the sort_index method, which returns a new, sorted object:

In [271]:
obj = pd.Series(np.arange(4), index = ["d", "a", "b", "c"])

In [272]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [273]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [274]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=["three", "one"], columns=["d", "a", "b", "c"])

In [275]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [276]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [277]:
frame.sort_index(axis = "columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default but can be sorted in descending order, too:

In [278]:
frame.sort_index(axis= "columns", ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its sort_values method:

In [279]:
obj = pd.Series([4, 7, -3, 2])

In [280]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [281]:
obj.sort_values(na_position = "first")

2   -3
3    2
0    4
1    7
dtype: int64

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to sort_values:

In [282]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [283]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [284]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [285]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

To sort by multiple columns, pass a list of names:

Ranking assigns ranks from one through the number of valid data points in an array, starting from the lowest value. The rank methods for Series and DataFrame are the place to look; by default, rank breaks ties by assigning each group the mean rank:

In [286]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [287]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [288]:
obj.rank(method = "first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.

In [290]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

See Table 5.6 for a list of tie-breaking methods available.

DataFrame can compute ranks over the rows or the columns:

In [293]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})

In [294]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [295]:
frame.rank(axis = "columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0


Table 5.6: Tie-breaking methods with rank
Method	    Description
"average"	Default: assign the average rank to each entry in the equal group
"min"	    Use the minimum rank for the whole group
"max"	    Use the maximum rank for the whole group
"first"	    Assign ranks in the order the values appear in the data
"dense"	    Like method="min", but ranks always increase by 1 between groups rather than the number of equal elements in a group

Up until now almost all of the examples we have looked at have unique axis labels (index values). While many pandas functions (like reindex) require that the labels be unique, it’s not mandatory. Let’s consider a small Series with duplicate indices:

In [296]:
obj = pd.Series(np.arange(5), index = ["a", "a", "b", "b", "c"])

In [297]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [298]:
obj.index.is_unique

False

In [299]:
obj["a"]

a    0
a    1
dtype: int64

In [300]:
obj["c"]

np.int64(4)

In [302]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), index=["a", "a", "b", "b", "c"])

In [303]:
df

          0         1         2
a -0.527422  2.173596 -1.006175
a  1.674057  0.588696  1.052098
b  0.083771 -0.053348 -0.150010
b -0.755823 -0.985565 -0.252959
c  0.709791  0.547313 -0.041409

In [304]:
df.loc["b"]

          0         1         2
b  0.083771 -0.053348 -0.150010
b -0.755823 -0.985565 -0.252959

In [305]:
df.loc["c"]

0    0.709791
1    0.547313
2   -0.041409
Name: c, dtype: float64

In [307]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index = ["a", "b", "c", "d"], columns = ["one", "two"])

In [308]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [309]:
df.sum(axis = "columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [310]:
df.sum(axis = "index", skipna = False)

one   NaN
two   NaN
dtype: float64

In [311]:
df.sum(axis = "columns", skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [312]:
df.mean(axis = "columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [314]:
df.idxmax()

one    b
two    d
dtype: object

In [315]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [316]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [317]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [318]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

Method	Description
count	Number of non-NA values
describe	Compute set of summary statistics
min, max	Compute minimum and maximum values
argmin, argmax	Compute index locations (integers) at which minimum or maximum value is obtained, respectively; not available on DataFrame objects
idxmin, idxmax	Compute index labels at which minimum or maximum value is obtained, respectively
quantile	Compute sample quantile ranging from 0 to 1 (default: 0.5)
sum	Sum of values
mean	Mean of values
median	Arithmetic median (50% quantile) of values
mad	Mean absolute deviation from mean value
prod	Product of all values
var	Sample variance of values
std	Sample standard deviation of values
skew	Sample skewness (third moment) of values
kurt	Sample kurtosis (fourth moment) of values
cumsum	Cumulative sum of values
cummin, cummax	Cumulative minimum or maximum of values, respectively
cumprod	Cumulative product of values
diff	Compute first arithmetic difference (useful for time series)
pct_change	Compute percent changes

Some summary statistics, like correlation and covariance, are computed from pairs of arguments. Let’s consider some DataFrames of stock prices and volumes originally obtained from Yahoo! Finance and available in binary Python pickle files you can find in the accompanying datasets for the book:

In [321]:
price = pd.read_pickle("examples/yahoo_price.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/yahoo_price.pkl'

In [322]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/yahoo_volume.pkl'

In [323]:
returns = price.pct_change()

NameError: name 'price' is not defined

In [324]:
returns.tail()

NameError: name 'returns' is not defined

The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. Relatedly, cov computes the covariance:

In [325]:
returns["MSFT"].corr(returns["IBM"])

NameError: name 'returns' is not defined

In [326]:
returns["MSFT"].cov(returns["IBM"])

NameError: name 'returns' is not defined

Using DataFrame’s corrwith method, you can compute pair-wise correlations between a DataFrame’s columns or rows with another Series or DataFrame. Passing a Series returns a Series with the correlation value computed for each column:

In [327]:
returns.corrwith(returns["IBM"])

NameError: name 'returns' is not defined

Passing a DataFrame computes the correlations of matching column names. Here, I compute correlations of percent changes with volume:

In [328]:
returns.corrwith(volume)

NameError: name 'returns' is not defined

Passing axis="columns" does things row-by-row instead. In all cases, the data points are aligned by label before the correlation is computed.

Unique Values, Value Counts, and Membership
Another class of related methods extracts information about the values contained in a one-dimensional Series. To illustrate these, consider this example:

In [329]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

The first function is unique, which gives you an array of the unique values in a Series:

In [331]:
uniques = obj.unique()

The unique values are not necessarily returned in the order in which they first appear, and not in sorted order, but they could be sorted after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies:

In [332]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

The Series is sorted by value in descending order as a convenience. value_counts is also available as a top-level pandas method that can be used with NumPy arrays or other Python sequences:

In [333]:
pd.value_counts(obj.to_numpy(), sort = False)

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/2072757793.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort = False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

isin performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame:

In [334]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [335]:
mask = obj.isin(["b", "c"])

In [336]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [337]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to isin is the Index.get_indexer method, which gives you an index array from an array of possibly nondistinct values into another array of distinct values:

In [338]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [339]:
unique_vals = pd.Series(["c", "b", "a"])

In [340]:
indicies = pd.Index(unique_vals).get_indexer(to_match)

In [341]:
indicies

array([0, 2, 1, 1, 0, 2])


Table 5.9: Unique, value counts, and set membership methods
Method	Description
isin	       Compute a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values
get_indexer	   Compute integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations
unique	         Compute an array of unique values in a Series, returned in the order observed
value_counts	Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order

In some cases, you may want to compute a histogram on multiple related columns in a DataFrame. Here’s an example:

In [342]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4], "Qu2": [2, 3, 1, 2, 3], "Qu3": [1, 5, 2, 4, 4]})

In [343]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

We can compute the value counts for a single column, like so:

In [345]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [346]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

To compute this for all columns, pass pandas.value_counts to the DataFrame’s apply method:

In [348]:
result = data.apply(pd.value_counts).fillna(0)

/var/folders/s0/t23nm4qx23g2m5_fh74n2lzw0000gq/T/ipykernel_69252/2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [350]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

Here, the row labels in the result are the distinct values occurring in all of the columns. The values are the respective counts of these values in each column.

There is also a DataFrame.value_counts method, but it computes counts considering each row of the DataFrame as a tuple to determine the number of occurrences of each distinct row:

In [351]:
data = pd.DataFrame({"a": [1,1,1,2,2], "b": [0,0,1,0,0]})

In [352]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [353]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64